modules/beakstar/mod-marginalia/literate-config.org
* Fix issue where posframe gets screwed up during counsel-apropos

When I do counsel-apropos the posframe that displays the search gets messed up because the lines are too long. This function basically undoes [[https://github.com/minad/marginalia/commit/ae454a2aa0c5d85b5e151938b310e7d16538157d][this commit]] which added additional information (which is what is making it too long).

#+begin_src emacs-lisp
(defun marginalia-annotate-symbol-fixed (cand)
  "Annotate symbol CAND with its documentation string."
  (when-let (sym (intern-soft cand))
    (marginalia--fields
     (:left (marginalia-annotate-binding cand))
     ((marginalia--symbol-class sym) :face 'marginalia-type)
     ((cond
       ((fboundp sym) (marginalia--function-doc sym))
       ((facep sym) (documentation-property sym 'face-documentation))
       (t (documentation-property sym 'variable-documentation)))
      :truncate 1.0 :face 'marginalia-documentation))))

(advice-add 'marginalia-annotate-symbol :override #'marginalia-annotate-symbol-fixed)
#+end_src
